In [1]:
! pip install pandas

WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: Ignoring invalid distribution -ip (c:\python310\lib\site-packages)
WARNING: You are using pip version 21.2.3; however, version 22.0.4 is available.
You should consider upgrading via the 'C:\Python310\python.exe -m pip install --upgrade pip' command.

Requirement already satisfied: pandas in c:\python310\lib\site-packages (1.4.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\python310\lib\site-packages (from pandas) (1.22.2)
Requirement already satisfied: pytz>=2020.1 in c:\python310\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd

# Series
Series is a one dimensional labelled array that can hold/stores data

In [3]:
book_title = [ 'C++', 'Java', 'Python', 'Javascript']
pd.Series(book_title)

0           C++
1          Java
2        Python
3    Javascript
dtype: object

In [4]:
type(book_title)

list

In [5]:
book_title=pd.Series(book_title)
type(book_title)

pandas.core.series.Series

In [6]:
#How To access using indexes :-
book_title[3]

'Javascript'

In [7]:
book_title= pd.Series(book_title, index= ['(i)','(ii)','(iii)','(iv)'])
book_title
#Here you will get error because, book_title is not a list any longer, it is now a 
#pandas Series, thats why that error.

(i)      NaN
(ii)     NaN
(iii)    NaN
(iv)     NaN
dtype: object

In [8]:
book_title2= ['C++','Java','Python','Javascript']
book_title2=pd.Series(book_title2,index=['(i)','(ii)','(iii)','(iv)'])
# OR
#book_title2=pd.Series(book_title2)
#book_title2.index= ['(i)','(ii)','(iii)','(iv)']
book_title2

(i)             C++
(ii)           Java
(iii)        Python
(iv)     Javascript
dtype: object

In [145]:
#This will give error
book_title2[(ii)]

NameError: name 'ii' is not defined

In [10]:
book_title2['(ii)']

'Java'

# DataFrame :
2D labelled array rather than 1D labelled array "Series"

In [11]:
import numpy as np

In [12]:
np_arr3=np.random.randint(10,100, size=(6,4))
np_arr3

array([[61, 49, 61, 33],
       [66, 61, 94, 86],
       [78, 40, 23, 16],
       [85, 67, 97, 74],
       [13, 77, 92, 16],
       [93, 54, 47, 74]])

In [13]:
df= pd.DataFrame(data = np_arr3)
df

    0   1   2   3
0  61  49  61  33
1  66  61  94  86
2  78  40  23  16
3  85  67  97  74
4  13  77  92  16
5  93  54  47  74

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
df[3]

0    33
1    86
2    16
3    74
4    16
5    74
Name: 3, dtype: int32

In [16]:
type(df[3])

pandas.core.series.Series

In [17]:
#change column names:
df= pd.DataFrame(data = np_arr3, columns = ['A','B','C','D'])
df
#or : df.columns=['A','B','C','D']

    A   B   C   D
0  61  49  61  33
1  66  61  94  86
2  78  40  23  16
3  85  67  97  74
4  13  77  92  16
5  93  54  47  74

In [18]:
df.shape

(6, 4)

In [19]:
df.head(n=3)

    A   B   C   D
0  61  49  61  33
1  66  61  94  86
2  78  40  23  16

In [20]:
df.tail(n=3)

    A   B   C   D
3  85  67  97  74
4  13  77  92  16
5  93  54  47  74

Extracting Columns :-

In [21]:
df['C']

0    61
1    94
2    23
3    97
4    92
5    47
Name: C, dtype: int32

In [22]:
df[['A','B']]

    A   B
0  61  49
1  66  61
2  78  40
3  85  67
4  13  77
5  93  54

In [23]:
# Or :
cols= ['A','B']
df[cols]

    A   B
0  61  49
1  66  61
2  78  40
3  85  67
4  13  77
5  93  54

Add new columns

In [24]:
df['A+B']=df['A']+ df['B']
df

    A   B   C   D  A+B
0  61  49  61  33  110
1  66  61  94  86  127
2  78  40  23  16  118
3  85  67  97  74  152
4  13  77  92  16   90
5  93  54  47  74  147

In [25]:
df.drop(columns=['A+B'])

    A   B   C   D
0  61  49  61  33
1  66  61  94  86
2  78  40  23  16
3  85  67  97  74
4  13  77  92  16
5  93  54  47  74

But , still when you will print df it will print the dropped columns also because we have not updated df to the new dropped one.

i.e,
df= df.drop(columns=['A+B'])
But there is another way also :

df.drop(columns=['A+B'], inplace = True)

In [26]:
df

    A   B   C   D  A+B
0  61  49  61  33  110
1  66  61  94  86  127
2  78  40  23  16  118
3  85  67  97  74  152
4  13  77  92  16   90
5  93  54  47  74  147

# Indexing or Extracting data :

In [27]:
df.index = "p q r s t u".split()
df

    A   B   C   D  A+B
p  61  49  61  33  110
q  66  61  94  86  127
r  78  40  23  16  118
s  85  67  97  74  152
t  13  77  92  16   90
u  93  54  47  74  147

In [28]:
df.loc['q']

A       66
B       61
C       94
D       86
A+B    127
Name: q, dtype: int32

In [29]:
#But this gives the error :
#df.loc['q','r']

iloc = integer location, need not rely on given array indexing

In [30]:
df.iloc[0]

A       61
B       49
C       61
D       33
A+B    110
Name: p, dtype: int32

In [31]:
# extracting multiple rows:
df.iloc[2:5]

    A   B   C   D  A+B
r  78  40  23  16  118
s  85  67  97  74  152
t  13  77  92  16   90

In [32]:
df.iloc[2:-1][['A','B']]

    A   B
r  78  40
s  85  67
t  13  77

Masking and Boolean indexing :

In [33]:
df

    A   B   C   D  A+B
p  61  49  61  33  110
q  66  61  94  86  127
r  78  40  23  16  118
s  85  67  97  74  152
t  13  77  92  16   90
u  93  54  47  74  147

In [34]:
masked_df= df>35
masked_df

       A     B      C      D   A+B
p   True  True   True  False  True
q   True  True   True   True  True
r   True  True  False  False  True
s   True  True   True   True  True
t  False  True   True  False  True
u   True  True   True   True  True

In [35]:
# Error :- df(masked_df)
df[masked_df]

      A   B     C     D  A+B
p  61.0  49  61.0   NaN  110
q  66.0  61  94.0  86.0  127
r  78.0  40   NaN   NaN  118
s  85.0  67  97.0  74.0  152
t   NaN  77  92.0   NaN   90
u  93.0  54  47.0  74.0  147

In [36]:
df[df>35]

      A   B     C     D  A+B
p  61.0  49  61.0   NaN  110
q  66.0  61  94.0  86.0  127
r  78.0  40   NaN   NaN  118
s  85.0  67  97.0  74.0  152
t   NaN  77  92.0   NaN   90
u  93.0  54  47.0  74.0  147

In [37]:
new_mask = df['B'] > 35
new_mask

p    True
q    True
r    True
s    True
t    True
u    True
Name: B, dtype: bool

Now, Notice the below output and difference

In [38]:
df[new_mask]

    A   B   C   D  A+B
p  61  49  61  33  110
q  66  61  94  86  127
r  78  40  23  16  118
s  85  67  97  74  152
t  13  77  92  16   90
u  93  54  47  74  147

In [39]:
df[new_mask][['C','D']]

    C   D
p  61  33
q  94  86
r  23  16
s  97  74
t  92  16
u  47  74

In [40]:
df['A']>40

p     True
q     True
r     True
s     True
t    False
u     True
Name: A, dtype: bool

In [41]:
df['C']<50

p    False
q    False
r     True
s    False
t    False
u     True
Name: C, dtype: bool

In [42]:
(df['A']>40) & (df['C']<50)

p    False
q    False
r     True
s    False
t    False
u     True
dtype: bool

In [43]:
df [ (df['A']>40) & (df['C']<50) ]

    A   B   C   D  A+B
r  78  40  23  16  118
u  93  54  47  74  147

Convert df into a numpy array and vice-versa :

In [44]:
df_np_arr= df.values
df_np_arr

array([[ 61,  49,  61,  33, 110],
       [ 66,  61,  94,  86, 127],
       [ 78,  40,  23,  16, 118],
       [ 85,  67,  97,  74, 152],
       [ 13,  77,  92,  16,  90],
       [ 93,  54,  47,  74, 147]])

In [45]:
pd.DataFrame(df_np_arr)

    0   1   2   3    4
0  61  49  61  33  110
1  66  61  94  86  127
2  78  40  23  16  118
3  85  67  97  74  152
4  13  77  92  16   90
5  93  54  47  74  147

# Irish Dataset (Intro) :

In [46]:
pd.read_csv("./iris.csv")
#t is a dataframe

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [47]:
iris = pd.read_csv("./iris.csv")
type(iris)

pandas.core.frame.DataFrame

In [48]:
iris.head()
# By default it will show, only 5 rows 
# else you have to enter the number of rows as n= 7

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [49]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [50]:
iris.shape

(150, 5)

In [51]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

But, iris.rows gives an error

In [52]:
# Datatypes of each columns :
#strings are treated as objects heer
iris.dtypes

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [53]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [54]:
iris.describe()
#it describes many thngs about columns

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [55]:
iris['species']

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [56]:
iris['species'].nunique()

3

In [57]:
iris['species'].unique()
# This are the different unique species

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [58]:
#How many setosa flowers are there :
iris['species']=='setosa'

0       True
1       True
2       True
3       True
4       True
       ...
145    False
146    False
147    False
148    False
149    False
Name: species, Length: 150, dtype: bool

In [59]:
#This will give you details about only 'setosa' species
#plants because of masking.
iris[ iris['species'] == 'setosa']

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
1            4.9          3.0           1.4          0.2  setosa
2            4.7          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
6            4.6          3.4           1.4          0.3  setosa
7            5.0          3.4           1.5          0.2  setosa
8            4.4          2.9           1.4          0.2  setosa
9            4.9          3.1           1.5          0.1  setosa
10           5.4          3.7           1.5          0.2  setosa
11           4.8          3.4           1.6          0.2  setosa
12           4.8          3.0           1.4          0.1  setosa
13           4.3          3.0           1.1          0.1  setosa
14           5.8          4.0           1.2          0.2  setosa
15           5.7          4.4           1.5          0.4  setosa
16           5.4          3.9           1.3          0.4  setosa
17           5.1          3.5           1.4          0.3  setosa
18           5.7          3.8           1.7          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa
20           5.4          3.4           1.7          0.2  setosa
21           5.1          3.7           1.5          0.4  setosa
22           4.6          3.6           1.0          0.2  setosa
23           5.1          3.3           1.7          0.5  setosa
24           4.8          3.4           1.9          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa
26           5.0          3.4           1.6          0.4  setosa
27           5.2          3.5           1.5          0.2  setosa
28           5.2          3.4           1.4          0.2  setosa
29           4.7          3.2           1.6          0.2  setosa
30           4.8          3.1           1.6          0.2  setosa
31           5.4          3.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa
34           4.9          3.1           1.5          0.1  setosa
35           5.0          3.2           1.2          0.2  setosa
36           5.5          3.5           1.3          0.2  setosa
37           4.9          3.1           1.5          0.1  setosa
38           4.4          3.0           1.3          0.2  setosa
39           5.1          3.4           1.5          0.2  setosa
40           5.0          3.5           1.3          0.3  setosa
41           4.5          2.3           1.3          0.3  setosa
42           4.4          3.2           1.3          0.2  setosa
43           5.0          3.5           1.6          0.6  setosa
44           5.1          3.8           1.9          0.4  setosa
45           4.8          3.0           1.4          0.3  setosa
46           5.1          3.8           1.6          0.2  setosa
47           4.6          3.2           1.4          0.2  setosa
48           5.3          3.7           1.5          0.2  setosa
49           5.0          3.3           1.4          0.2  setosa

In [60]:
iris[ iris['species']=='setosa' ].shape

(50, 5)

In [61]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [62]:
iris['species'].value_counts()['virginica']

50

In [63]:
iris['petal_width'].mean()

1.1986666666666668

In [64]:
iris.sort_values(by= "sepal_length")

     sepal_length  sepal_width  petal_length  petal_width    species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In the above sorting, we can see that sepal_length of many are asame so , you can choose the criteria of sorting also that when the sorting criteria is same then do this. (by giving another arguements)

In [108]:
iris.sort_values(by=["sepal_length","sepal_width"])

    sepal_length  sepal_width  petal_length  petal_width species
13           4.3          3.0           1.1          0.1  setosa
8            4.4          2.9           1.4          0.2  setosa
38           4.4          3.0           NaN          0.2  setosa
42           4.4          3.2           1.3          0.2  setosa
3            4.6          3.1           1.5          0.2  setosa
..           ...          ...           ...          ...     ...
5            NaN          3.9           1.7          0.4  setosa
16           NaN          3.9           1.3          0.4  setosa
14           NaN          4.0           NaN          0.2  setosa
32           NaN          4.1           1.5          0.1  setosa
15           NaN          4.4           1.5          0.4  setosa

[150 rows x 5 columns]

.apply() takes functions as its arguements and apply that function to all the dataframe . You can apply your custom functions also.

In [109]:
iris['species'].apply(len)
# 6 : because of 6 characters of setos and similiarly 9 because of 9 chars 
# of virginica, len actually calculates length of each elements.

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [110]:
iris.apply(len)

sepal_length    150
sepal_width     150
petal_length    150
petal_width     150
species         150
dtype: int64

In [111]:
iris.apply(lambda x: x)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             NaN          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           NaN          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           NaN          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [112]:
iris.apply(lambda x: x+x)

     sepal_length  sepal_width  petal_length  petal_width             species
0            10.2          7.0           2.8          0.4        setosasetosa
1             9.8          6.0           2.8          0.4        setosasetosa
2             9.4          6.4           2.6          0.4        setosasetosa
3             9.2          6.2           3.0          0.4        setosasetosa
4             NaN          7.2           NaN          0.4        setosasetosa
..            ...          ...           ...          ...                 ...
145          13.4          6.0          10.4          4.6  virginicavirginica
146          12.6          5.0          10.0          3.8  virginicavirginica
147          13.0          6.0           NaN          4.0  virginicavirginica
148          12.4          6.8          10.8          4.6  virginicavirginica
149           NaN          6.0          10.2          3.6  virginicavirginica

[150 rows x 5 columns]

In [113]:
#This can be also done like iris.apply(lambda x: x**2) i.e, 
#Square of each elements but it will here give error because 
#square is not valid for strings which are there in the elements.

# Grouping Data :

In [114]:
iris.aggregate('min')

sepal_length       4.3
sepal_width        2.0
petal_length       1.1
petal_width        0.1
species         setosa
dtype: object

In [115]:
iris.aggregate(['min','max','mean','median'])

C:\Users\chand\AppData\Local\Temp\ipykernel_48652\214860762.py:1: FutureWarning: ['species'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  iris.aggregate(['min','max','mean','median'])

        sepal_length  sepal_width  petal_length  petal_width    species
min         4.300000        2.000      1.100000     0.100000     setosa
max         7.700000        4.400      6.900000     2.500000  virginica
mean        5.855102        3.054      3.817778     1.198667        NaN
median      5.800000        3.000      4.400000     1.300000        NaN

In [116]:
groupedIris = iris.groupby('species')
groupedIris

In [117]:
groupedIris.min()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa               4.3          2.3           1.1          0.1
versicolor           5.0          2.0           3.0          1.0
virginica            5.6          2.2           4.5          1.4

In [118]:
groupedIris2= iris.groupby(['species','sepal_length'])
groupedIris2.min()

                         sepal_width  petal_length  petal_width
species    sepal_length
setosa     4.3                   3.0           1.1          0.1
           4.4                   2.9           1.3          0.2
           4.6                   3.1           1.4          0.2
           4.7                   3.2           1.3          0.2
           4.8                   3.0           1.4          0.2
           4.9                   3.0           1.4          0.1
           5.0                   3.2           1.5          0.2
           5.1                   3.3           1.4          0.2
           5.2                   3.4           1.4          0.2
           5.4                   3.4           NaN          0.4
           5.5                   3.5           1.3          0.2
           5.7                   3.8           1.7          0.3
versicolor 5.0                   2.0           3.5          1.0
           5.2                   2.7           3.9          1.4
           5.5                   2.3           3.8          1.0
           5.6                   2.5           4.1          1.1
           5.7                   2.8           4.1          1.2
           5.8                   2.6           3.9          1.0
           5.9                   3.0           4.2          1.5
           6.0                   2.2           4.0          1.0
           6.1                   2.8           4.0          1.2
           6.2                   2.2           4.5          1.5
           6.3                   2.5           4.7          1.5
           6.4                   2.9           4.3          1.3
           6.5                   2.8           4.6          1.5
           6.6                   3.0           4.4          1.4
           6.7                   3.0           4.4          1.4
virginica  5.6                   2.8           4.9          2.0
           5.8                   2.7           5.1          1.9
           6.0                   2.2           4.8          1.5
           6.1                   3.0           4.9          1.8
           6.2                   3.4           5.4          2.3
           6.3                   2.5           4.9          1.5
           6.4                   2.8           5.3          2.1
           6.5                   3.0           5.5          1.8
           6.7                   3.0           5.2          2.3
           6.8                   3.0           5.5          2.1
           6.9                   3.1           5.4          2.1
           7.1                   3.0           5.9          2.1
           7.2                   3.0           5.8          1.6
           7.3                   2.9           6.3          1.8
           7.4                   2.8           6.1          1.9
           7.6                   3.0           6.6          2.1
           7.7                   2.6           6.1          2.2

In [119]:
groupedIris.sum()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa             157.3        170.9          64.1         12.2
versicolor         177.8        138.5         195.8         66.3
virginica          238.7        148.7         255.5        101.3

In [120]:
#groupedIris2.sum()

In [121]:
groupedIris.describe()

           sepal_length                                                    \
                  count      mean       std  min    25%   50%    75%  max
species
setosa             32.0  4.915625  0.342768  4.3  4.675  4.90  5.100  5.7
versicolor         30.0  5.926667  0.436233  5.0  5.600  5.85  6.275  6.7
virginica          36.0  6.630556  0.587401  5.6  6.300  6.50  7.125  7.7

           sepal_width         ... petal_length      petal_width         \
                 count   mean  ...          75%  max       count   mean
species                        ...
setosa            50.0  3.418  ...        1.600  1.9        50.0  0.244
versicolor        50.0  2.770  ...        4.575  5.1        50.0  1.326
virginica         50.0  2.974  ...        5.875  6.9        50.0  2.026


                 std  min  25%  50%  75%  max
species
setosa      0.107210  0.1  0.2  0.2  0.3  0.6
versicolor  0.197753  1.0  1.2  1.3  1.5  1.8
virginica   0.274650  1.4  1.8  2.0  2.3  2.5

[3 rows x 32 columns]

In [122]:
#For better view ,take transpose if needed
groupedIris.describe().T

species                setosa  versicolor  virginica
sepal_length count  32.000000   30.000000  36.000000
             mean    4.915625    5.926667   6.630556
             std     0.342768    0.436233   0.587401
             min     4.300000    5.000000   5.600000
             25%     4.675000    5.600000   6.300000
             50%     4.900000    5.850000   6.500000
             75%     5.100000    6.275000   7.125000
             max     5.700000    6.700000   7.700000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  43.000000   46.000000  46.000000
             mean    1.490698    4.256522   5.554348
             std     0.158586    0.466024   0.539014
             min     1.100000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.600000
             75%     1.600000    4.575000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

# Handling Missing Data
(i) BY Dropping that value

(ii) By Filling some value/approx value there

In [123]:
#First let me create some missing value in iris.
nan_idx= np.random.randint(0,150,20)
iris['sepal_length'][nan_idx] = np.nan
#To suppress the warning in this output. You can do this before  :
#import warnings
#warnings.filterwarnings('ignore')

C:\Users\chand\AppData\Local\Temp\ipykernel_48652\3868794767.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iris['sepal_length'][nan_idx] = np.nan

In [124]:
iris['sepal_length']

0      5.1
1      4.9
2      4.7
3      4.6
4      NaN
      ...
145    NaN
146    6.3
147    NaN
148    6.2
149    NaN
Name: sepal_length, Length: 150, dtype: float64

In [125]:
nan_idx2= np.random.randint(0,150,15)
iris['petal_length'][nan_idx2] = np.nan

C:\Users\chand\AppData\Local\Temp\ipykernel_48652\3610767496.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iris['petal_length'][nan_idx2] = np.nan

In [126]:
iris['petal_length']

0      NaN
1      1.4
2      NaN
3      1.5
4      NaN
      ...
145    5.2
146    5.0
147    NaN
148    5.4
149    5.1
Name: petal_length, Length: 150, dtype: float64

In [127]:
iris['petal_width'].sum()

179.8

In [128]:
iris.isna().sum()

sepal_length    65
sepal_width      0
petal_length    28
petal_width      0
species          0
dtype: int64

In [129]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           NaN          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           NaN          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             NaN          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           NaN          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           NaN          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           NaN          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [132]:
#Drop the values, All rows having nan values will be dropped
#iris.dropna()
#Notice the difference in number of rows

In [135]:
iris['sepal_length'].fillna(value= "FILL THIS")

0            5.1
1            4.9
2            4.7
3            4.6
4      FILL THIS
         ...
145    FILL THIS
146          6.3
147    FILL THIS
148          6.2
149    FILL THIS
Name: sepal_length, Length: 150, dtype: object

In [146]:
meanOfSepalLength = iris['sepal_length'].mean()
print(meanOfSepalLength)
iris['sepal_length'].fillna(value = meanOfSepalLength)

5.79764705882353

0      5.100000
1      4.900000
2      4.700000
3      4.600000
4      5.797647
         ...
145    5.797647
146    6.300000
147    5.797647
148    6.200000
149    5.797647
Name: sepal_length, Length: 150, dtype: float64

In [147]:
round(meanOfSepalLength)

6

In [153]:
#To view, a fixed number of rows of a dataset
#iris['sepal_length'][:12]

# Concatanate/Merge Two DataFrames

In [154]:
new_df = pd.DataFrame( np.random.randint(0,8,size = (10,4)))
new_df

   0  1  2  3
0  1  2  7  1
1  1  5  0  4
2  4  4  7  1
3  4  2  1  6
4  2  6  4  2
5  6  1  7  3
6  5  4  4  5
7  1  2  5  1
8  6  3  4  1
9  1  0  0  3

In [156]:
new_df['species']='new_species'
new_df

   0  1  2  3      species
0  1  2  7  1  new_species
1  1  5  0  4  new_species
2  4  4  7  1  new_species
3  4  2  1  6  new_species
4  2  6  4  2  new_species
5  6  1  7  3  new_species
6  5  4  4  5  new_species
7  1  2  5  1  new_species
8  6  3  4  1  new_species
9  1  0  0  3  new_species

It is very imp that while concatanating row-wise, the columns names should be same and also number of columns too and vice-versa

In [160]:
new_df.columns= iris.columns
new_df

   sepal_length  sepal_width  petal_length  petal_width      species
0             1            2             7            1  new_species
1             1            5             0            4  new_species
2             4            4             7            1  new_species
3             4            2             1            6  new_species
4             2            6             4            2  new_species
5             6            1             7            3  new_species
6             5            4             4            5  new_species
7             1            2             5            1  new_species
8             6            3             4            1  new_species
9             1            0             0            3  new_species

Axis = 0 : Horizontal/Row Wise

Axis = 1 : Vertical/Column-wise

In [163]:
pd.concat((iris,new_df),axis = 0)
#Try : pd.concat((iris,new_df),axis =1)

    sepal_length  sepal_width  petal_length  petal_width      species
0            5.1          3.5           NaN          0.2       setosa
1            4.9          3.0           1.4          0.2       setosa
2            4.7          3.2           NaN          0.2       setosa
3            4.6          3.1           1.5          0.2       setosa
4            NaN          3.6           NaN          0.2       setosa
..           ...          ...           ...          ...          ...
5            6.0          1.0           7.0          3.0  new_species
6            5.0          4.0           4.0          5.0  new_species
7            1.0          2.0           5.0          1.0  new_species
8            6.0          3.0           4.0          1.0  new_species
9            1.0          0.0           0.0          3.0  new_species

[160 rows x 5 columns]

Just for check always check the number of rows and columns

# Now, Merge :

In [174]:
df2 = pd.DataFrame({'Stu_Name' : ['A','B','C','D'], 'CPI' : [6.2,6,4.4,6.6]})
df3 = pd.DataFrame({'Stu2_Name' : ['first','B','third','D'], 'CPI' : [7.3,6,4.4,8]})

In [175]:
#Here, the common attribute (CPI here) play a key role here
df2.merge(df3, how= 'inner')

  Stu_Name  CPI Stu2_Name
0        B  6.0         B
1        C  4.4     third

In left joint, It will completely take the left dataframe and for the right dataframe , it has only taken the elements for the common attributes from the second dataframe and rest NaN and vice-versa

In [180]:
df2.merge(df3, how = 'left')

  Stu_Name  CPI Stu2_Name
0        A  6.2       NaN
1        B  6.0         B
2        C  4.4     third
3        D  6.6       NaN

In [179]:
df2.merge(df3, how = 'right')

  Stu_Name  CPI Stu2_Name
0      NaN  7.3     first
1        B  6.0         B
2        C  4.4     third
3      NaN  8.0         D

Outer join will take all values from left join on the top and also from the right join at the bottom and common attribute rows in the middle. Notice it :-

In [182]:
df2.merge(df3, how = 'outer')

  Stu_Name  CPI Stu2_Name
0        A  6.2       NaN
1        B  6.0         B
2        C  4.4     third
3        D  6.6       NaN
4      NaN  7.3     first
5      NaN  8.0         D

# How to output file from Pandas

In [183]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           NaN          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           NaN          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             NaN          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           NaN          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           NaN          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           NaN          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [184]:
iris.isna().sum()

sepal_length    65
sepal_width      0
petal_length    28
petal_width      0
species          0
dtype: int64

In [185]:
iris.to_csv('./outputed_dataset_iris.csv')

The new csv file has been created in path given.
# Notice : 
A extra column (of indexes) has been added on the left

In [188]:
#Error :
outputed_dataset_iris.csv.head()

NameError: name 'outputed_dataset_iris' is not defined

In [189]:
#So,
outputed_dataset_iris = pd.read_csv('./outputed_dataset_iris.csv')
outputed_dataset_iris

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.1,3.5,NaN,0.2,setosa
1,1,4.9,3.0,1.4,0.2,setosa
2,2,4.7,3.2,NaN,0.2,setosa
3,3,4.6,3.1,1.5,0.2,setosa
4,4,NaN,3.6,NaN,0.2,setosa
...,...,...,...,...,...,...
145,145,NaN,3.0,5.2,2.3,virginica
146,146,6.3,2.5,5.0,1.9,virginica
147,147,NaN,3.0,NaN,2.0,virginica
148,148,6.2,3.4,5.4,2.3,virginica
149,149,NaN,3.0,5.1,1.8,virginica

You can see an extra column named 'unnamed' in the above dataset

To remove this extra column :

In [194]:
outputed_dataset_iris = iris.to_csv('./outputed_dataset_iris.csv', index= False)
outputed_dataset_iris= pd.read_csv('./outputed_dataset_iris.csv')
outputed_dataset_iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           NaN          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           NaN          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             NaN          3.6           NaN          0.2     setosa
..            ...          ...           ...          ...        ...
145           NaN          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           NaN          3.0           NaN          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           NaN          3.0           5.1          1.8  virginica

[150 rows x 5 columns]